function zzz
%用自定义函数求生成矩阵scjyjzlz1.m
%校验矩阵之间的转换

%标准矩阵之间的互换
G1=[1 0 1 0 1 1;
    0 1 1 1 1 0];
H2=[1   0   0   0   0   0   1;
    0   1   0   0   0   1   1;
    0   0   1   0   1   0   0;
    0   0   0   1   1   0   1];
H1=gen2par(G1);G2=gen2par(H2);

%非标准之间的互换
G3=[1 0 1 0 1 1;
   0 1 1 1 1 0;
   0 0 0 1 1 1];
H4=[0   1   1   0   0   0   1;
    0   1   0   0   0   1   1;
    1   1   1   0   1   0   0;
    0   0   0   1   1   0   1];
H3=cgen2par(G3);G4=cgen2par(H4);
G1,H1,G2,H2,G3,H3,G4,H4
gf(G1)*gf(H1'),gf(G2)*gf(H2'),gf(G3)*gf(H3'),gf(G4)*gf(H4')
